import ukrajinska

def test_edge_cases():
    words = [
        "м'ясо", "підйом", "сьогодні", "мільйон",
        "В'ячеслав", "Зйомка", "Щука", "Ґудзик",
        "ЛЬВІВ", "Ольвія"
    ]

    for word in words:
        latin = ukrajinska.to_latin(word)
        restored = ukrajinska.to_cyrillic(latin)
        assert word == restored, f"Failed on word: {word}"

def test_full_text():
    original = """За його словами, 22 червня, Зеленський заслухає дипломатичну доповідь щодо цього питання 
    і вже тоді ухвалить рішення. "В понеділок будемо доповідати президенту України щодо готовності до 
    конференції з питань відновлення України, наслідків тих чи інших рішень та модальностей її проведення. 
    За результатами цього президент ухвалить рішення", -  цитує Сибігу пресслужба МЗС.
    
    Заявлена раніше мета конференції в Гданську - це посилення міжнародної підтримки відбудови України та 
    стимулювання інвестицій в український бізнес. Захід має зосередитися на тих галузях, які найбільше 
    постраждали від російської агресії - енергетиці, критичній інфраструктурі та логістиці. 
    Ще однією метою конференції заявлене зміцнення безпекових спроможностей України.
    """

    latin = ukrajinska.to_latin(original)
    restored = ukrajinska.to_cyrillic(latin)

    assert original == restored
